# set arguments for all 'cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Brew tap
tap homebrew/cask
# tap coretech/terrafile

# tools
brew "wget" # Internet file retriever
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "htop"
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "gnutls"

# programming related
brew "node"
brew "nvm" # Manage multiple Node.js versions
brew "yarn"
brew "python-yq"
brew "go"

# Docker, Containers, Kubernetes...
brew "docker" # Pack, ship and run any application as a lightweight container
brew "colima" # Container runtimes on MacOS (and Linux) with minimal setup

# Git
brew "git" # Distributed revision control system
brew "act" # Run your GitHub Actions locally
brew "gh" # GitHub command-line tool

# AWS Tools
brew "awscli" # Official Amazon AWS command-line interface
brew "rain" # Command-line tool for working with AWS CloudFormation
brew "cloudformation-guard" # Checks CloudFormation templates for compliance using a declarative syntax
brew "aws-cdk" # AWS Cloud Development Kit - framework for defining AWS infra as code
#brew "eksctl" # Simple command-line tool for creating clusters on Amazon EKS
# cask "amazon-chime"
# brew "aws-iam-authenticator" # 
# brew "eks-anywhere" # ARM CPU's are not yet supported (22/9/22)
# cask "session-manager-plugin" # Session Manager Plugin for the AWS CLI


# usr/bin/ln -s /opt/homebrew/bin/session-manager-plugin /usr/local/bin/session-manager-plugin
# usr/bin/ln -s /opt/homebrew/bin/aws /usr/local/bin/aws

brew "virtualenv"
brew "rbenv" # Ruby version manager

# Terraform related
# brew "terrafile" # Systematically manage external modules from Github for use in Terraform
#brew "tfenv" # Terraform version manager inspired by rbenv
#brew "tflint" # Linter for Terraform files
#brew "checkov"
#brew "policy_sentry"
#brew "infracost"
#brew "terraform-docs"

# Kubernetes
# brew "kubernetes-cli"
# brew "kompose"
# brew "cdk8s"
# brew "kubectx"
# brew "k9s"
# brew #consul-k8s"
# brew #datree#
# brew "kubens"

# Casks
cask "arc"
cask "balenaetcher"
cask "betterdisplay"
cask "bitwarden"
cask "bluesnooze"
cask "drawio"
cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "iterm2"
cask "leapp"
cask "slack"
cask "telegram-desktop"
cask "textsniper"
cask "visual-studio-code"
cask "whatsapp"
cask "xmind"

# vscode extensions
vscode "GitHub.codespaces"
vscode "github.copilot" # Get Code Suggestions in real-time, right in your IDE
vscode "github.vscode-github-actions" # extension lets you manage your workflows, view the workflow run history, and helps with authoring workflows
vscode "boto3typed.boto3-ide" # extension to enable code completion and type checking for all boto3 services. Supports pip, poetry and pipenv installers
vscode "ms-azuretools.vscode-docker" # Docker extension makes it easy to build, manage, and deploy containerized applications from Visual Studio Code.
vscode "hediet.vscode-drawio" # integrates Draw.io (also known as diagrams.net) into VS Code.
vscode "eamodio.gitlens" # powerful open-source extension for Visual Studio Code.
vscode "equinusocio.vsc-community-material-theme" # Material theme
vscode "4ops.terraform"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "vscode-icons-team.vscode-icons"
